app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page], per_page: params[:per_page]).order('title')
---
SELECT  "posts".* FROM "posts"  ORDER BY title LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.user = User.find_by email:params[:email]
    respond_to do |format|
      if @post.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "my@email.com"]]
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My new post kek"], ["body", "lel"], ["user_id", 1], ["created_at", "2016-10-24 12:08:08.899993"], ["updated_at", "2016-10-24 12:08:08.899993"]]

  def update
    @post.user = User.find_by email: params[:email]
    respond_to do |format|
      if @post.update(post_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "bobm@gmail.com"]]
UPDATE "posts" SET "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["user_id", 1], ["updated_at", "2016-10-24 12:24:08.906231"], ["id", 7]]

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]