app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: params[:per_page]).order('lastname, firstname')
---
SELECT  "users".* FROM "users"  ORDER BY lastname, firstname LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "Bob"], ["lastname", "Marley"], ["email", "bobm@gmail.com"], ["created_at", "2016-10-24 12:03:56.795640"], ["updated_at", "2016-10-24 12:03:56.795640"]]